### Topics for today
* Merge & join dataframes
* Data Wrangling of adults.data
* Data Wrangling of Healthcare payments data

<hr>

In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'Name':['a','b','c'],'Age':[11,22,33]})

In [8]:
df2 = pd.DataFrame({'Name':['a','c','b'],'Marks':[111,222,333]})

In [9]:
df1

  Name  Age
0    a   11
1    b   22
2    c   33

In [10]:
df2

  Name  Marks
0    a    111
1    c    222
2    b    333

In [11]:
pd.merge(df1,df2)

  Name  Age  Marks
0    a   11    111
1    b   22    333
2    c   33    222

In [12]:
pd.merge(df1,df2, on='Name')

  Name  Age  Marks
0    a   11    111
1    b   22    333
2    c   33    222

In [13]:
df1 = pd.DataFrame({'Name':['a','b','c'],'Age':[11,22,33]})

In [14]:
df2 = pd.DataFrame({'NameId':['a','c','b'],'Marks':[111,222,333]})

* Sometimes dataframe have different column name

In [16]:
pd.merge(df1,df2, left_on='Name', right_on='NameId')

  Name  Age NameId  Marks
0    a   11      a    111
1    b   22      b    333
2    c   33      c    222

In [17]:
df1 = pd.DataFrame({'Name':['a','b','c','a'],'Age':[11,22,33,44]})

In [18]:
df1

  Name  Age
0    a   11
1    b   22
2    c   33
3    a   44

In [19]:
pd.merge(df1,df2, left_on='Name', right_on='NameId')

  Name  Age NameId  Marks
0    a   11      a    111
1    a   44      a    111
2    b   22      b    333
3    c   33      c    222

In [20]:
df2

  NameId  Marks
0      a    111
1      c    222
2      b    333

* Many to Many Relationship

In [21]:
df1

  Name  Age
0    a   11
1    b   22
2    c   33
3    a   44

In [22]:
df2 = pd.DataFrame({'NameId':['a','c','b','c'],'Marks':[111,222,333,444]})

In [23]:
df2

  NameId  Marks
0      a    111
1      c    222
2      b    333
3      c    444

In [24]:
pd.merge(df1,df2,left_on='Name', right_on='NameId')

  Name  Age NameId  Marks
0    a   11      a    111
1    a   44      a    111
2    b   22      b    333
3    c   33      c    222
4    c   33      c    444

### Data Wrangling of Adult's data

In [29]:
cols = ['age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship'
        ,'race','sex','capital-gain','capital-loss','hours-per-week','native-country','Salary']

adult_data = pd.read_csv('https://raw.githubusercontent.com/zekelabs/data-science-complete-tutorial/master/Data/adult.data.txt', names=cols)

In [30]:
adult_data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,Salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [31]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
Salary            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

### Identify string columns

In [33]:
cat_adult_data = adult_data.select_dtypes(include=['object'])

In [34]:
cat_adult_data.head()

,workclass,education,marital-status,occupation,relationship,race,sex,native-country,Salary
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K

In [35]:
cat_adult_data['native-country'].unique()

array([' United-States', ' Cuba', ' Jamaica', ' India', ' ?', ' Mexico',
       ' South', ' Puerto-Rico', ' Honduras', ' England', ' Canada',
       ' Germany', ' Iran', ' Philippines', ' Italy', ' Poland',
       ' Columbia', ' Cambodia', ' Thailand', ' Ecuador', ' Laos',
       ' Taiwan', ' Haiti', ' Portugal', ' Dominican-Republic',
       ' El-Salvador', ' France', ' Guatemala', ' China', ' Japan',
       ' Yugoslavia', ' Peru', ' Outlying-US(Guam-USVI-etc)', ' Scotland',
       ' Trinadad&Tobago', ' Greece', ' Nicaragua', ' Vietnam', ' Hong',
       ' Ireland', ' Hungary', ' Holand-Netherlands'], dtype=object)

In [36]:
cat_adult_data['native-country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: native-country, dtype: int64

* Remove white spaces before & after the country

In [39]:
cat_adult_data['native-country'] = cat_adult_data['native-country'].str.strip()

/home/awantik/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [40]:
cat_adult_data['native-country'].unique()

array(['United-States', 'Cuba', 'Jamaica', 'India', '?', 'Mexico',
       'South', 'Puerto-Rico', 'Honduras', 'England', 'Canada', 'Germany',
       'Iran', 'Philippines', 'Italy', 'Poland', 'Columbia', 'Cambodia',
       'Thailand', 'Ecuador', 'Laos', 'Taiwan', 'Haiti', 'Portugal',
       'Dominican-Republic', 'El-Salvador', 'France', 'Guatemala',
       'China', 'Japan', 'Yugoslavia', 'Peru',
       'Outlying-US(Guam-USVI-etc)', 'Scotland', 'Trinadad&Tobago',
       'Greece', 'Nicaragua', 'Vietnam', 'Hong', 'Ireland', 'Hungary',
       'Holand-Netherlands'], dtype=object)

In [41]:
cat_adult_data.fillna({'?':'NA'}, inplace=True)

In [42]:
cat_adult_data.workclass.unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [43]:
cat_adult_data.education.unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [45]:
for col in cat_adult_data.columns:
    cat_adult_data[col] = cat_adult_data[col].str.strip()

/home/awantik/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [46]:
num_adult_data = adult_data.select_dtypes(exclude=['object'])

In [47]:
num_adult_data.head()

   age  fnlwgt  education-num  capital-gain  capital-loss  hours-per-week
0   39   77516             13          2174             0              40
1   50   83311             13             0             0              13
2   38  215646              9             0             0              40
3   53  234721              7             0             0              40
4   28  338409             13             0             0              40

In [48]:
num_adult_data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

* Combining two same sized dataframe horizontally

In [52]:
transformed_df = pd.concat([num_adult_data,cat_adult_data],axis=1)

In [53]:
transformed_df.Salary.value_counts()

<=50K    24720
>50K      7841
Name: Salary, dtype: int64

### Find average working hours for differnt salary bracket people

In [55]:
transformed_df.groupby('Salary')['hours-per-week'].mean()

Salary
<=50K    38.840210
>50K     45.473026
Name: hours-per-week, dtype: float64

### Is there any work-domain specific relation with maritial-status about hours spent in a week

In [57]:
transformed_df.head()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week,workclass,education,marital-status,occupation,relationship,race,sex,native-country,Salary
0,39,77516,13,2174,0,40,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,50,83311,13,0,0,13,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,38,215646,9,0,0,40,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,53,234721,7,0,0,40,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,28,338409,13,0,0,40,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K

In [58]:
import numpy as np

In [59]:
transformed_df.pivot_table(index='marital-status',columns=['occupation'],values='hours-per-week', aggfunc=np.mean)

occupation,?,Adm-clerical,Armed-Forces,Craft-repair,Exec-managerial,Farming-fishing,Handlers-cleaners,Machine-op-inspct,Other-service,Priv-house-serv,Prof-specialty,Protective-serv,Sales,Tech-support,Transport-moving
marital-status,,,,,,,,,,,,,,,
Divorced,35.345946,39.310134,NaN,42.622845,44.991722,44.062500,40.398438,40.895307,37.560878,29.392857,42.302412,44.329114,42.048387,40.492857,46.364641
Married-AF-spouse,8.500000,40.600000,NaN,57.333333,40.000000,44.000000,NaN,NaN,28.750000,NaN,46.666667,40.000000,47.500000,NaN,80.000000
Married-civ-spouse,31.786499,39.322515,42.666667,42.997660,46.134615,50.106087,40.766595,41.973764,38.775934,38.062500,44.203198,43.926893,45.392664,41.019802,45.410463
Married-spouse-absent,34.620690,36.457627,NaN,41.807692,47.096774,40.166667,41.434783,41.269231,36.677966,39.000000,39.574468,40.000000,38.911765,36.166667,46.473684
Never-married,32.517510,35.869893,39.666667,40.427752,42.434293,42.806228,35.399425,39.092820,32.106642,34.283582,39.996759,40.044872,35.178923,37.646526,42.100000
Separated,33.378788,39.346939,NaN,41.970874,42.787234,43.944444,40.526316,39.011905,37.347368,28.666667,40.626263,43.312500,38.419355,37.821429,42.081081
Widowed,24.320261,33.257669,NaN,35.609756,38.333333,39.434783,36.000000,37.679245,30.661017,30.500000,36.152174,35.222222,35.447619,32.368421,38.080000

In [62]:
transformed_df[(transformed_df.occupation == 'Armed-Forces') & (transformed_df['marital-status'] == 'Divorced')]

Empty DataFrame
Columns: [age, fnlwgt, education-num, capital-gain, capital-loss, hours-per-week, workclass, education, marital-status, occupation, relationship, race, sex, native-country, Salary]
Index: []

### Loading Payments Data

In [63]:
payments_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/payments-data.csv')

/home/awantik/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (4,24,35,36,37,40,42,43,53,54,55,56,57,58,59,60,61,62,63,64,65,66,68,69,70,71) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [65]:
len(payments_data.columns)

75

In [66]:
payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29999 entries, 0 to 29998
Data columns (total 75 columns):
Change_Type                                                          29999 non-null object
Covered_Recipient_Type                                               29999 non-null object
Teaching_Hospital_CCN                                                79 non-null float64
Teaching_Hospital_ID                                                 79 non-null float64
Teaching_Hospital_Name                                               79 non-null object
Physician_Profile_ID                                                 29920 non-null float64
Physician_First_Name                                                 29920 non-null object
Physician_Middle_Name                                                22778 non-null object
Physician_Last_Name                                                  29918 non-null object
Physician_Name_Suffix                                                1027 non-null object
Recipient_Primary_Business_Street_Address_Line1                      29999 non-null object
Recipient_Primary_Business_Street_Address_Line2                      14265 non-null object
Recipient_City                                                       29999 non-null object
Recipient_State                                                      29999 non-null object
Recipient_Zip_Code                                                   29999 non-null object
Recipient_Country                                                    29999 non-null object
Recipient_Province                                                   0 non-null float64
Recipient_Postal_Code                                                0 non-null float64
Physician_Primary_Type                                               29920 non-null object
Physician_Specialty                                                  29902 non-null object
Physician_License_State_code1                                        29920 non-null object
Physician_License_State_code2                                        2648 non-null object
Physician_License_State_code3                                        437 non-null object
Physician_License_State_code4                                        74 non-null object
Physician_License_State_code5                                        13 non-null object
Submitting_Applicable_Manufacturer_or_Applicable_GPO_Name            29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_ID          29999 non-null int64
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Name        29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_State       29995 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Country     29999 non-null object
Total_Amount_of_Payment_USDollars                                    29999 non-null float64
Date_of_Payment                                                      29999 non-null object
Number_of_Payments_Included_in_Total_Amount                          29999 non-null int64
Form_of_Payment_or_Transfer_of_Value                                 29999 non-null object
Nature_of_Payment_or_Transfer_of_Value                               29999 non-null object
City_of_Travel                                                       446 non-null object
State_of_Travel                                                      423 non-null object
Country_of_Travel                                                    446 non-null object
Physician_Ownership_Indicator                                        29920 non-null object
Third_Party_Payment_Recipient_Indicator                              29999 non-null object
Name_of_Third_Party_Entity_Receiving_Payment_or_Transfer_of_Value    34 non-null object
Charity_Indicator                                                    27076 non-null object
Third_Party_Equals_Covered_Recipient_Indicator                       844 non-null object
Contextual_Information                                               173 non-null object
Delay_in_Publication_Indicator                                       29999 non-null object
Record_ID                                                            29999 non-null int64
Dispute_Status_for_Publication                                       29999 non-null object
Related_Product_Indicator                                            29999 non-null object
Covered_or_Noncovered_Indicator_1                                    29087 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1            29087 non-null object
Product_Category_or_Therapeutic_Area_1                               28989 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1             28787 non-null object
Associated_Drug_or_Biological_NDC_1                                  23162 non-null object
Covered_or_Noncovered_Indicator_2                                    1955 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_2            1955 non-null object
Product_Category_or_Therapeutic_Area_2                               1955 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_2             1774 non-null object
Associated_Drug_or_Biological_NDC_2                                  29 non-null object
Covered_or_Noncovered_Indicator_3                                    1042 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_3            1042 non-null object
Product_Category_or_Therapeutic_Area_3                               1042 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_3             1042 non-null object
Associated_Drug_or_Biological_NDC_3                                  29 non-null object
Covered_or_Noncovered_Indicator_4                                    1013 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_4            1013 non-null object
Product_Category_or_Therapeutic_Area_4                               1013 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_4             1013 non-null object
Associated_Drug_or_Biological_NDC_4                                  0 non-null float64
Covered_or_Noncovered_Indicator_5                                    1013 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_5            1013 non-null object
Product_Category_or_Therapeutic_Area_5                               1013 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_5             1013 non-null object
Associated_Drug_or_Biological_NDC_5                                  0 non-null float64
Program_Year                                                         29999 non-null int64
Payment_Publication_Date                                             29999 non-null object
dtypes: float64(8), int64(4), object(63)
memory usage: 17.2+ MB

### Cleaning the data
* Droppping all the columns where more than 5000 rows are NA

In [72]:
payments_data['Associated_Drug_or_Biological_NDC_5'].isnull().sum()

29999

In [74]:
cols_to_be_removed = []
for col in payments_data.columns:
    if payments_data[col].isnull().sum() > 5000:
        cols_to_be_removed.append(col)

In [76]:
payments_data.drop(columns=cols_to_be_removed,axis=1, inplace=True)

In [77]:
payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29999 entries, 0 to 29998
Data columns (total 36 columns):
Change_Type                                                         29999 non-null object
Covered_Recipient_Type                                              29999 non-null object
Physician_Profile_ID                                                29920 non-null float64
Physician_First_Name                                                29920 non-null object
Physician_Last_Name                                                 29918 non-null object
Recipient_Primary_Business_Street_Address_Line1                     29999 non-null object
Recipient_City                                                      29999 non-null object
Recipient_State                                                     29999 non-null object
Recipient_Zip_Code                                                  29999 non-null object
Recipient_Country                                                   29999 non-null object
Physician_Primary_Type                                              29920 non-null object
Physician_Specialty                                                 29902 non-null object
Physician_License_State_code1                                       29920 non-null object
Submitting_Applicable_Manufacturer_or_Applicable_GPO_Name           29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_ID         29999 non-null int64
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Name       29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_State      29995 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Country    29999 non-null object
Total_Amount_of_Payment_USDollars                                   29999 non-null float64
Date_of_Payment                                                     29999 non-null object
Number_of_Payments_Included_in_Total_Amount                         29999 non-null int64
Form_of_Payment_or_Transfer_of_Value                                29999 non-null object
Nature_of_Payment_or_Transfer_of_Value                              29999 non-null object
Physician_Ownership_Indicator                                       29920 non-null object
Third_Party_Payment_Recipient_Indicator                             29999 non-null object
Charity_Indicator                                                   27076 non-null object
Delay_in_Publication_Indicator                                      29999 non-null object
Record_ID                                                           29999 non-null int64
Dispute_Status_for_Publication                                      29999 non-null object
Related_Product_Indicator                                           29999 non-null object
Covered_or_Noncovered_Indicator_1                                   29087 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1           29087 non-null object
Product_Category_or_Therapeutic_Area_1                              28989 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1            28787 non-null object
Program_Year                                                        29999 non-null int64
Payment_Publication_Date                                            29999 non-null object
dtypes: float64(2), int64(4), object(30)
memory usage: 8.2+ MB

* Convert string to datetime object so that we can do further operation

In [80]:
payments_data.Date_of_Payment = pd.to_datetime(payments_data.Date_of_Payment)

In [81]:
payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29999 entries, 0 to 29998
Data columns (total 36 columns):
Change_Type                                                         29999 non-null object
Covered_Recipient_Type                                              29999 non-null object
Physician_Profile_ID                                                29920 non-null float64
Physician_First_Name                                                29920 non-null object
Physician_Last_Name                                                 29918 non-null object
Recipient_Primary_Business_Street_Address_Line1                     29999 non-null object
Recipient_City                                                      29999 non-null object
Recipient_State                                                     29999 non-null object
Recipient_Zip_Code                                                  29999 non-null object
Recipient_Country                                                   29999 non-null object
Physician_Primary_Type                                              29920 non-null object
Physician_Specialty                                                 29902 non-null object
Physician_License_State_code1                                       29920 non-null object
Submitting_Applicable_Manufacturer_or_Applicable_GPO_Name           29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_ID         29999 non-null int64
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Name       29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_State      29995 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Country    29999 non-null object
Total_Amount_of_Payment_USDollars                                   29999 non-null float64
Date_of_Payment                                                     29999 non-null datetime64[ns]
Number_of_Payments_Included_in_Total_Amount                         29999 non-null int64
Form_of_Payment_or_Transfer_of_Value                                29999 non-null object
Nature_of_Payment_or_Transfer_of_Value                              29999 non-null object
Physician_Ownership_Indicator                                       29920 non-null object
Third_Party_Payment_Recipient_Indicator                             29999 non-null object
Charity_Indicator                                                   27076 non-null object
Delay_in_Publication_Indicator                                      29999 non-null object
Record_ID                                                           29999 non-null int64
Dispute_Status_for_Publication                                      29999 non-null object
Related_Product_Indicator                                           29999 non-null object
Covered_or_Noncovered_Indicator_1                                   29087 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1           29087 non-null object
Product_Category_or_Therapeutic_Area_1                              28989 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1            28787 non-null object
Program_Year                                                        29999 non-null int64
Payment_Publication_Date                                            29999 non-null object
dtypes: datetime64[ns](1), float64(2), int64(4), object(29)
memory usage: 8.2+ MB

In [83]:
payments_data.Date_of_Payment

0       2016-02-12
1       2016-02-13
2       2016-02-13
3       2016-01-26
4       2016-01-26
           ...
29994   2016-07-13
29995   2016-07-13
29996   2016-08-04
29997   2016-08-04
29998   2016-08-04
Name: Date_of_Payment, Length: 29999, dtype: datetime64[ns]

In [87]:
payments_data[payments_data.Date_of_Payment == '2016-07-13'].Date_of_Payment

1365    2016-07-13
1586    2016-07-13
1590    2016-07-13
1606    2016-07-13
1610    2016-07-13
           ...
29397   2016-07-13
29992   2016-07-13
29993   2016-07-13
29994   2016-07-13
29995   2016-07-13
Name: Date_of_Payment, Length: 64, dtype: datetime64[ns]

In [89]:
payments_data[(payments_data.Date_of_Payment >= '2016-07-13') & (payments_data.Date_of_Payment <= '2016-07-15')].Date_of_Payment

437     2016-07-14
743     2016-07-14
812     2016-07-14
876     2016-07-14
979     2016-07-15
           ...
29438   2016-07-15
29992   2016-07-13
29993   2016-07-13
29994   2016-07-13
29995   2016-07-13
Name: Date_of_Payment, Length: 345, dtype: datetime64[ns]

* If you have to do lot of operations on date, better make date column as index

In [90]:
payments_data.head()

,Change_Type,Covered_Recipient_Type,Physician_Profile_ID,Physician_First_Name,Physician_Last_Name,Recipient_Primary_Business_Street_Address_Line1,Recipient_City,Recipient_State,Recipient_Zip_Code,Recipient_Country,...,Delay_in_Publication_Indicator,Record_ID,Dispute_Status_for_Publication,Related_Product_Indicator,Covered_or_Noncovered_Indicator_1,Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1,Product_Category_or_Therapeutic_Area_1,Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1,Program_Year,Payment_Publication_Date
0,NEW,Covered Recipient Physician,132655.0,GREGG,ALZATE,8745 AERO DRIVE,SAN DIEGO,CA,92123,United States,...,No,346039438,No,Yes,Covered,Device,Radiology,StabiliT,2016,06/30/2017
1,NEW,Covered Recipient Physician,132655.0,GREGG,ALZATE,8745 AERO DRIVE,SAN DIEGO,CA,92123,United States,...,No,346039440,No,Yes,Covered,Device,Radiology,StabiliT,2016,06/30/2017
2,NEW,Covered Recipient Physician,1006832.0,SADEER,ALZUBAIDI,10401 W THUNDERBIRD BLVD,SUN CITY,AZ,85351,United States,...,No,346039442,No,Yes,Covered,Device,Radiology,StabiliT,2016,06/30/2017
3,NEW,Covered Recipient Physician,1006832.0,SADEER,ALZUBAIDI,10401 W THUNDERBIRD BLVD,SUN CITY,AZ,85351,United States,...,No,346039444,No,Yes,Covered,Device,Radiology,StabiliT,2016,06/30/2017
4,NEW,Covered Recipient Physician,1006832.0,SADEER,ALZUBAIDI,10401 W THUNDERBIRD BLVD,SUN CITY,AZ,85351,United States,...,No,346039446,No,Yes,Covered,Device,Radiology,StabiliT,2016,06/30/2017

### Create fullname column from firstname & lastname

In [92]:
payments_data['Physician_Full_Name'] = payments_data.Physician_First_Name + ' ' + payments_data.Physician_Last_Name

In [93]:
payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29999 entries, 0 to 29998
Data columns (total 37 columns):
Change_Type                                                         29999 non-null object
Covered_Recipient_Type                                              29999 non-null object
Physician_Profile_ID                                                29920 non-null float64
Physician_First_Name                                                29920 non-null object
Physician_Last_Name                                                 29918 non-null object
Recipient_Primary_Business_Street_Address_Line1                     29999 non-null object
Recipient_City                                                      29999 non-null object
Recipient_State                                                     29999 non-null object
Recipient_Zip_Code                                                  29999 non-null object
Recipient_Country                                                   29999 non-null object
Physician_Primary_Type                                              29920 non-null object
Physician_Specialty                                                 29902 non-null object
Physician_License_State_code1                                       29920 non-null object
Submitting_Applicable_Manufacturer_or_Applicable_GPO_Name           29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_ID         29999 non-null int64
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Name       29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_State      29995 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Country    29999 non-null object
Total_Amount_of_Payment_USDollars                                   29999 non-null float64
Date_of_Payment                                                     29999 non-null datetime64[ns]
Number_of_Payments_Included_in_Total_Amount                         29999 non-null int64
Form_of_Payment_or_Transfer_of_Value                                29999 non-null object
Nature_of_Payment_or_Transfer_of_Value                              29999 non-null object
Physician_Ownership_Indicator                                       29920 non-null object
Third_Party_Payment_Recipient_Indicator                             29999 non-null object
Charity_Indicator                                                   27076 non-null object
Delay_in_Publication_Indicator                                      29999 non-null object
Record_ID                                                           29999 non-null int64
Dispute_Status_for_Publication                                      29999 non-null object
Related_Product_Indicator                                           29999 non-null object
Covered_or_Noncovered_Indicator_1                                   29087 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1           29087 non-null object
Product_Category_or_Therapeutic_Area_1                              28989 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1            28787 non-null object
Program_Year                                                        29999 non-null int64
Payment_Publication_Date                                            29999 non-null object
Physician_Full_Name                                                 29918 non-null object
dtypes: datetime64[ns](1), float64(2), int64(4), object(30)
memory usage: 8.5+ MB

In [94]:
payments_data.Physician_Primary_Type.value_counts()

Medical Doctor                  26369
Doctor of Osteopathy             2540
Doctor of Podiatric Medicine      648
Doctor of Optometry               207
Doctor of Dentistry               156
Name: Physician_Primary_Type, dtype: int64

In [95]:
payments_data.Physician_Specialty.value_counts()

Allopathic & Osteopathic Physicians|Obstetrics & Gynecology               6160
Allopathic & Osteopathic Physicians|Internal Medicine|Gastroenterology    3961
Allopathic & Osteopathic Physicians|Family Medicine                       3500
Allopathic & Osteopathic Physicians|Internal Medicine                     2497
Allopathic & Osteopathic Physicians|Urology                               2216
                                                                          ...
Allopathic & Osteopathic Physicians|Anesthesiology|Addiction Medicine        1
Other Service Providers|Medical Genetics, Ph.D. Medical Genetics             1
Dental Providers|Dentist|Pediatric Dentistry                                 1
Allopathic & Osteopathic Physicians|Internal Medicine|Sports Medicine        1
Allopathic & Osteopathic Physicians|Pediatrics|Pediatric Pulmonology         1
Name: Physician_Specialty, Length: 157, dtype: int64

In [96]:
payments_data.Total_Amount_of_Payment_USDollars

0         90.87
1         23.45
2         32.00
3        630.20
4         25.00
          ...
29994     10.44
29995     14.46
29996     18.49
29997     18.49
29998     26.42
Name: Total_Amount_of_Payment_USDollars, Length: 29999, dtype: float64

In [97]:
payments_data.groupby('Physician_Primary_Type').Total_Amount_of_Payment_USDollars.mean()

Physician_Primary_Type
Doctor of Dentistry              62.542949
Doctor of Optometry              37.833140
Doctor of Osteopathy             49.030201
Doctor of Podiatric Medicine    365.706929
Medical Doctor                  213.870095
Name: Total_Amount_of_Payment_USDollars, dtype: float64

### Assignments for the session
#### On payments data
1. Find which city should you be planning the next hospital branch
2. Find total charity payments

#### On adult data
1. Education & hours-per-week
2. Any interesting relationship between workclass & education-num

In [99]:
payments_data.Number_of_Payments_Included_in_Total_Amount.value_counts()

1     29992
3         3
2         2
12        1
5         1
Name: Number_of_Payments_Included_in_Total_Amount, dtype: int64

In [101]:
payments_data.Charity_Indicator.value_counts()

No     27067
Yes        9
Name: Charity_Indicator, dtype: int64